app/Controllers/Approval.php

    public function InsertData()
    {
        $session = session();
        $db = \Config\Database::connect();

        $data = [
            'execution_stock_id' => $this->request->getPost('execution_stock_id'),
            'user_id' => $session->get('id_user'),
            'role' => 'qc',
            'approved_qty' => $this->request->getPost('approved_qty'),
            'rejected_qty' => $this->request->getPost('rejected_qty'),
            'notes_approval' => $this->request->getPost('notes_approval'),
            'approve_at' => date('Y-m-d H:i:s'),
        ];

        $this->ModelEksekusiApproval->InsertData($data);

        // Update execution_stocks (setelah approval)
        $db->table('execution_stocks')
            ->where('id_execution_stock', $data['execution_stock_id'])
            ->update([
                'status' => 'approved',
                'final_qty' => $data['approved_qty']
            ]);

        $row = $db->table('execution_stocks')
            ->select('production_execution_id, material_id')
            ->where('id_execution_stock', $data['execution_stock_id'])
            ->get()
            ->getRow();

        if ($row) {
            $db->table('production_executions')
                ->where('id_production_execution', $row->production_execution_id)
                ->update([
                    'status_execution' => 'approved'
                ]);

            $execution = $db->table('production_executions')
                ->select('production_order_id')
                ->where('id_production_execution', $row->production_execution_id)
                ->get()
                ->getRow();

            if ($execution) {
                // Cek apakah masih ada pending lain di production_execution_id yang sama
                $pendingCount = $db->table('execution_stocks')
                    ->where('production_execution_id', $row->production_execution_id)
                    ->where('status', 'pending')
                    ->countAllResults();

                $order = $db->table('production_orders')
                    ->where('id_production_order', $execution->production_order_id)
                    ->get()
                    ->getRow();

                if ($order && $pendingCount == 0) {
                    // Update status_order ke 'completed'
                    $db->table('production_orders')
                        ->where('id_production_order', $execution->production_order_id)
                        ->update([
                            'status_order' => 'completed'
                        ]);

                    $planning = $db->table('production_plannings')
                        ->where('id', $order->production_planning_id)
                        ->get()
                        ->getRow();
---
UPDATE `execution_stocks` SET `status` = 'approved', `final_qty` = '5'
WHERE `id_execution_stock` = '10'
SELECT `production_execution_id`, `material_id`
FROM `execution_stocks`
WHERE `id_execution_stock` = '10'
UPDATE `production_executions` SET `status_execution` = 'approved'
WHERE `id_production_execution` = '2'
SELECT `production_order_id`
FROM `production_executions`
WHERE `id_production_execution` = '2'
SELECT COUNT(*) AS `numrows`
FROM `execution_stocks`
WHERE `production_execution_id` = '4'
AND `status` = 'pending'
SELECT *
FROM `production_orders`
WHERE `id_production_order` = '4'
UPDATE `production_orders` SET `status_order` = 'completed'
WHERE `id_production_order` = '2'
SELECT *
FROM `production_plannings`
WHERE `id` = '2'

                                'status_production' => 'completed',
                            ]);
                    } else {
                        $db->table('production_plannings')
                            ->where('id', $order->production_planning_id)
                            ->update([
                                'order_log' => 'completed',
                            ]);
---
UPDATE `production_plannings` SET `order_log` = 'completed'
WHERE `id` = '2'

                }
            }

            $db->table('materials')
                ->where('id_material', $row->material_id)
                ->set('max_stock', 'max_stock + ' . (int)$data['approved_qty'], false)
                ->update();
---
UPDATE `materials` SET `max_stock` = max_stock + 5
WHERE `id_material` = '36'