app/Controllers/Bom.php

SELECT *
FROM `materials`
WHERE `type` IN ('raw')
---
    public function index($step_id = null)
    {
        if ($step_id !== null) {
            $boms = $this->ModelBom->getByStep($step_id);
        } else {
            $boms = $this->ModelBom->findAll();
        }

        foreach ($boms as &$bom) {
            $bom['bom_details'] = $this->ModelBomDetail->getBomDetailsByBomId($bom['id_bom']);
        }

        // Tentukan view sesuai tahap
        $viewMap = [
            1 => 'admin/v_bom_tahap1',
            2 => 'admin/v_bom_tahap2',
            3 => 'admin/v_bom_tahap3',
            4 => 'admin/v_bom_tahap4',
        ];

        // Filter material berdasarkan step_id
        $materialTypes = ['raw'];
        if ($step_id >= 2) $materialTypes[] = 'tahap1';
        if ($step_id >= 3) $materialTypes[] = 'tahap2';
        if ($step_id >= 4) $materialTypes[] = 'tahap3';

        if ($step_id !== null) {
            $materials = $this->ModelMaterial->whereIn('type', $materialTypes)->findAll();