app/Controllers/Eksekusi.php

UPDATE `execution_stocks` SET `approved` = 1
WHERE `id_execution_stock` = '1'
SELECT `production_execution_id`
FROM `execution_stocks`
WHERE `id_execution_stock` = '1'
UPDATE `production_executions` SET `status_execution` = 'awaiting_approval'
WHERE `id_production_execution` = '2'
---
    public function KirimApproval()
    {
        $session = session();
        $db = \Config\Database::connect();

        $data = [
            'execution_stock_id' => $this->request->getPost('execution_stock_id'),
            'user_id' => $session->get('id_user'),
            'role' => 'spv',
            'approved_qty' => $this->request->getPost('approved_qty'),
            'rejected_qty' => 0,
            'notes_approval' => 'Pengajuan Realisasi',
            'approve_at' => date('Y-m-d H:i:s'),
        ];

        $this->ModelEksekusiProduksi->InsertApproval($data);

        // Update status approved di execution_stocks
        $db->table('execution_stocks')
            ->where('id_execution_stock', $data['execution_stock_id'])
            ->update([
                'approved' => true
            ]);

        // Ambil production_execution_id dari execution_stocks
        $row = $db->table('execution_stocks')
            ->select('production_execution_id')
            ->where('id_execution_stock', $data['execution_stock_id'])
            ->get()
            ->getRow();

        // Update status_execution di production_executions
        if ($row) {
            $db->table('production_executions')
                ->where('id_production_execution', $row->production_execution_id)
                ->update([
                    'status_execution' => 'awaiting_approval'
                ]);