app/Controllers/Laporan.php

SELECT *
FROM `materials`
---
    public function print()
    {
        $data['materials'] = $this->ModelMaterial->findAll();