app/Controllers/Material.php

    public function index($type = 'raw') // default ke 'raw' jika tidak ada parameter
    {
        // Mapping type ke view
        $viewMap = [
            'raw'    => 'admin/v_material',
            'tahap1' => 'admin/v_hasil_tahap1',
            'tahap2' => 'admin/v_hasil_tahap2',
            'tahap3' => 'admin/v_hasil_tahap3',
            'tahap4' => 'admin/v_hasil_tahap4',
        ];

        // Cek apakah type valid, jika tidak default ke 'raw'
        if (!array_key_exists($type, $viewMap)) {
            $type = 'raw';
        }

        $data = [
            'judul' => 'Material',
            'subjudul' => '',
            'menu' => 'material',
            'submenu' => '',
            'page' => $viewMap[$type],
            'materials' => $this->ModelMaterial->where('type', $type)->findAll(),
---
SELECT *
FROM `materials`
WHERE `type` = 'raw'