app/Controllers/Order.php

SELECT *
FROM `materials`
WHERE `source_process_step_id` = '1'
---
    public function index()
    {
        $production_orders = $this->ModelOrderProduksi->AllData();

        foreach ($production_orders as &$order) {
            $order['production_order_details'] = $this->ModelOrderDetail->getOrderDetailsByOrderId($order['id_production_order']);
            $order['outputs'] = $this->ModelMaterial->where('source_process_step_id', $order['process_step_id'])->findAll();