app/Models/ModelProduksi.php

    public function AllData()
    {
        return $this->db->table('production_plannings')
            ->join('products', 'products.id_product=production_plannings.product_id')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `production_plannings`
JOIN `products` ON `products`.`id_product`=`production_plannings`.`product_id`
ORDER BY `id` DESC