app/Models/ModelMaterial.php

    public function AllData()
    {
        return $this->db->table('materials')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `materials`

    public function Counts()
    {
        return $this->db->table('materials')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `materials`