app/Models/ModelProduk.php

SELECT *
FROM `products`
---
    public function AllData()
    {
        return $this->db->table('products')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function Counts()
    {
        return $this->db->table('products')->countAllResults();