app/Models/ModelEksekusiApproval.php

SELECT `execution_stocks`.*, `process_steps`.`step_name`, `process_steps`.`step_order`, `production_orders`.`order_number`, `production_orders`.`planned_date_order`, `products`.`product_name`
FROM `execution_stocks`
LEFT JOIN `process_steps` ON `process_steps`.`id_process_step` = `execution_stocks`.`process_step_id`
LEFT JOIN `production_executions` ON `production_executions`.`id_production_execution` = `execution_stocks`.`production_execution_id`
LEFT JOIN `production_orders` ON `production_orders`.`id_production_order` = `production_executions`.`production_order_id`
LEFT JOIN `products` ON `products`.`id_product` = `production_orders`.`product_id`
WHERE `execution_stocks`.`approved` = 1
ORDER BY `id_execution_stock` DESC
---
    public function AllData()
    {
        return $this->db->table('execution_stocks')
            ->select('execution_stocks.*, process_steps.step_name, process_steps.step_order, production_orders.order_number,
                production_orders.planned_date_order, products.product_name')
            ->join('process_steps', 'process_steps.id_process_step = execution_stocks.process_step_id', 'left')
            ->join('production_executions', 'production_executions.id_production_execution = execution_stocks.production_execution_id', 'left')
            ->join('production_orders', 'production_orders.id_production_order = production_executions.production_order_id', 'left')
            ->join('products', 'products.id_product = production_orders.product_id', 'left')
            ->where('execution_stocks.approved', true)
            ->orderBy('id_execution_stock', 'desc')
            ->get()
            ->getResultArray();