app/Models/ModelEksekusiStok.php

    public function getExecutionStocksByExecutionId($production_execution_id)
    {
        return $this->select('execution_stocks.*, materials.material_name, process_steps.step_name')
            ->join('materials', 'materials.id_material = execution_stocks.material_id', 'left')
            ->join('process_steps', 'process_steps.id_process_step=execution_stocks.process_step_id')
            ->where('execution_stocks.production_execution_id', $production_execution_id)
            ->findAll();
---
SELECT `execution_stocks`.*, `materials`.`material_name`, `process_steps`.`step_name`
FROM `execution_stocks`
LEFT JOIN `materials` ON `materials`.`id_material` = `execution_stocks`.`material_id`
JOIN `process_steps` ON `process_steps`.`id_process_step`=`execution_stocks`.`process_step_id`
WHERE `execution_stocks`.`production_execution_id` = '2'

    public function getSingleStockByExecutionId($executionId)
    {
        return $this->select('execution_stocks.*, materials.material_name, process_steps.step_name')
            ->join('materials', 'materials.id_material = execution_stocks.material_id', 'left')
            ->join('process_steps', 'process_steps.id_process_step = execution_stocks.process_step_id', 'left')
            ->where('execution_stocks.production_execution_id', $executionId)
            ->first();
---
SELECT `execution_stocks`.*, `materials`.`material_name`, `process_steps`.`step_name`
FROM `execution_stocks`
LEFT JOIN `materials` ON `materials`.`id_material` = `execution_stocks`.`material_id`
LEFT JOIN `process_steps` ON `process_steps`.`id_process_step` = `execution_stocks`.`process_step_id`
WHERE `execution_stocks`.`production_execution_id` = '2'
 LIMIT 1

    public function getExecutionStocksByPlanningId($planningId)
    {
        return $this->select('execution_stocks.final_qty, production_orders.order_number')
            ->join('production_plannings', 'production_plannings.id=execution_stocks.production_planning_id')
            ->join('production_orders', 'production_orders.production_planning_id=production_plannings.id')
            ->where('execution_stocks.production_planning_id', $planningId)
            ->orderBy('execution_stocks.id_execution_stock', 'DESC')  // Mengurutkan berdasarkan ID terbaru
---
SELECT `execution_stocks`.`final_qty`, `production_orders`.`order_number`
FROM `execution_stocks`
JOIN `production_plannings` ON `production_plannings`.`id`=`execution_stocks`.`production_planning_id`
JOIN `production_orders` ON `production_orders`.`production_planning_id`=`production_plannings`.`id`
WHERE `execution_stocks`.`production_planning_id` = '3'
ORDER BY `execution_stocks`.`id_execution_stock` DESC
 LIMIT 1