app/Models/ModelOrderDetail.php

    public function getOrderDetailsByOrderId($production_order_id)
    {
        return $this->select('production_order_details.*, materials.material_name')
            ->join('materials', 'materials.id_material = production_order_details.material_id', 'left')
            // ->join('execution_stocks', 'execution_stocks.material_id=materials.id_material', 'left')
            ->where('production_order_details.production_order_id', $production_order_id)
            ->findAll();
---
SELECT `production_order_details`.*, `materials`.`material_name`
FROM `production_order_details`
LEFT JOIN `materials` ON `materials`.`id_material` = `production_order_details`.`material_id`
WHERE `production_order_details`.`production_order_id` = '3'