app/Models/ModelEksekusiProduksi.php

    public function AllData()
    {
        return $this->db->table('production_executions')
            ->join('production_orders', 'production_orders.id_production_order=production_executions.production_order_id')
            ->join('process_steps', 'process_steps.id_process_step=production_orders.process_step_id')
            ->join('products', 'products.id_product = production_orders.product_id')
            ->join('tbl_user', 'tbl_user.id_user=production_executions.user_id')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `production_executions`
JOIN `production_orders` ON `production_orders`.`id_production_order`=`production_executions`.`production_order_id`
JOIN `process_steps` ON `process_steps`.`id_process_step`=`production_orders`.`process_step_id`
JOIN `products` ON `products`.`id_product` = `production_orders`.`product_id`
JOIN `tbl_user` ON `tbl_user`.`id_user`=`production_executions`.`user_id`

    public function InsertApproval($data)
    {
        $this->db->table('execution_approvals')->insert($data);
---
INSERT INTO `execution_approvals` (`execution_stock_id`, `user_id`, `role`, `approved_qty`, `rejected_qty`, `notes_approval`, `approve_at`) VALUES ('1', '1', 'spv', '5', 0, 'Pengajuan Realisasi', '2025-04-27 17:05:32')