app/Models/ModelPembelian.php

SELECT *
FROM `inventories`
JOIN `materials` ON `materials`.`id_material`=`inventories`.`material_id`
ORDER BY `id_inventory` DESC
---
    public function AllData()
    {
        return $this->db->table('inventories')
            ->join('materials', 'materials.id_material=inventories.material_id')
            ->orderBy('id_inventory', 'DESC')
            ->get()
            ->getResultArray();