app/Models/ModelEksekusiApproval.php

    public function AllData()
    {
        return $this->db->table('execution_stocks')
            ->select('execution_stocks.*, process_steps.step_name, process_steps.step_order, production_orders.order_number,
                production_orders.planned_date_order, products.product_name')
            ->join('process_steps', 'process_steps.id_process_step = execution_stocks.process_step_id', 'left')
            ->join('production_executions', 'production_executions.id_production_execution = execution_stocks.production_execution_id', 'left')
            ->join('production_orders', 'production_orders.id_production_order = production_executions.production_order_id', 'left')
            ->join('products', 'products.id_product = production_orders.product_id', 'left')
            ->where('execution_stocks.approved', true)
            ->get()
            ->getResultArray();
---
SELECT `execution_stocks`.*, `process_steps`.`step_name`, `process_steps`.`step_order`, `production_orders`.`order_number`, `production_orders`.`planned_date_order`, `products`.`product_name`
FROM `execution_stocks`
LEFT JOIN `process_steps` ON `process_steps`.`id_process_step` = `execution_stocks`.`process_step_id`
LEFT JOIN `production_executions` ON `production_executions`.`id_production_execution` = `execution_stocks`.`production_execution_id`
LEFT JOIN `production_orders` ON `production_orders`.`id_production_order` = `production_executions`.`production_order_id`
LEFT JOIN `products` ON `products`.`id_product` = `production_orders`.`product_id`
WHERE `execution_stocks`.`approved` = 1

    public function InsertData($data)
    {
        $this->db->table('execution_approvals')->insert($data);
---
INSERT INTO `execution_approvals` (`execution_stock_id`, `user_id`, `role`, `approved_qty`, `rejected_qty`, `notes_approval`, `approve_at`) VALUES ('10', '1', 'qc', '5', '0', '-', '2025-04-27 17:07:07')

    public function getApprovalByExecutionStock($id_execution_stock)
    {
        return $this->db->table('execution_approvals')
            ->select('execution_approvals.*, tbl_user.nama_user as approved_by')
            ->join('tbl_user', 'tbl_user.id_user = execution_approvals.user_id', 'left')
            ->where('execution_approvals.execution_stock_id', $id_execution_stock)
            ->orderBy('approve_at', 'asc')
            ->get()
            ->getResultArray();
---
SELECT `execution_approvals`.*, `tbl_user`.`nama_user` as `approved_by`
FROM `execution_approvals`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `execution_approvals`.`user_id`
WHERE `execution_approvals`.`execution_stock_id` = '26'
ORDER BY `approve_at` ASC