app/Models/ModelBom.php

SELECT `boms`.*, `products`.`product_name`, `process_steps`.`step_name`
FROM `boms`
JOIN `products` ON `products`.`id_product` = `boms`.`product_id`
JOIN `process_steps` ON `process_steps`.`id_process_step` = `boms`.`process_step_id`
WHERE `boms`.`process_step_id` = '1'
ORDER BY `boms`.`id_bom` DESC
---
    public function getByStep($step_id)
    {
        return $this->select('boms.*, products.product_name, process_steps.step_name, materials.material_name')
            ->join('products', 'products.id_product = boms.product_id')
            ->join('materials', 'materials.id_material = boms.material_hasil_id')
            ->join('process_steps', 'process_steps.id_process_step = boms.process_step_id')
            ->where('boms.process_step_id', $step_id)
            ->orderBy('boms.id_bom', 'DESC')
            ->findAll();