app/Models/ModelStruktur.php

SELECT `material_requirements`.*, `materials`.`material_name`, `materials`.`bom`, `materials`.`max_stock`
FROM `material_requirements`
LEFT JOIN `materials` ON `materials`.`id_material` = `material_requirements`.`material_id`
WHERE `material_requirements`.`production_planning_id` = '3'
AND `material_requirements`.`process_step_id` = 1
---
    public function getMaterialRequirementByProductionId($production_planning_id, $status = null)
    {
        $builder = $this->select('material_requirements.*, materials.material_name, materials.max_stock')
            ->join('materials', 'materials.id_material = material_requirements.material_id', 'left')
            ->where('material_requirements.production_planning_id', $production_planning_id);

        if (!is_null($status)) {
            $builder->where('material_requirements.process_step_id', $status);
        }

        return $builder->findAll();