app/Models/ModelBomDetail.php

    public function getBomDetailsByBomId($bom_id)
    {
        return $this->select('bom_details.*, materials.material_name')
                    ->join('materials', 'materials.id_material = bom_details.material_id', 'left')
                    ->where('bom_details.bom_id', $bom_id)
                    ->findAll();
---
SELECT `bom_details`.*, `materials`.`material_name`
FROM `bom_details`
LEFT JOIN `materials` ON `materials`.`id_material` = `bom_details`.`material_id`
WHERE `bom_details`.`bom_id` = '16'