app/Models/ModelOrderProduksi.php

SELECT *
FROM `production_orders`
JOIN `products` ON `products`.`id_product` = `production_orders`.`product_id`
JOIN `boms` ON `boms`.`id_bom`=`production_orders`.`bom_id`
JOIN `process_steps` ON `process_steps`.`id_process_step`=`production_orders`.`process_step_id`
---
    public function AllData()
    {
        return $this->db->table('production_orders')
            ->join('products', 'products.id_product = production_orders.product_id')
            ->join('boms', 'boms.id_bom=production_orders.bom_id')
            ->join('process_steps', 'process_steps.id_process_step=production_orders.process_step_id')
            ->get()
            ->getResultArray();