app/Models/ModelSupplier.php

    public function AllData()
    {
        return $this->db->table('suppliers')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `suppliers`

    public function Counts()
    {
        return $this->db->table('suppliers')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `suppliers`