app/Models/ModelUser.php

    public function LoginUser($email, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '88ea39439e74fa27c09a4fc0bc8ebe6d00978392'

    public function Counts()
    {
        return $this->db->table('tbl_user')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`