app/Models/ModelStruktur.php

SELECT *
FROM `material_requirements`
JOIN `production_plannings` ON `production_plannings`.`id`=`material_requirements`.`production_planning_id`
JOIN `materials` ON `materials`.`id_material`=`material_requirements`.`material_id`
JOIN `products` ON `products`.`id_product`=`production_plannings`.`product_id`
ORDER BY `id_material_requirement` DESC
---
    public function AllData()
    {
        return $this->db->table('material_requirements')
            ->join('production_plannings', 'production_plannings.id=material_requirements.production_planning_id')
            ->join('materials', 'materials.id_material=material_requirements.material_id')
            ->join('products', 'products.id_product=production_plannings.product_id')
            ->orderBy('id_material_requirement', 'DESC')
            ->get()
            ->getResultArray();